In [1]:
import pandas as pd
import numpy as np

In [86]:
df = pd.read_csv("/Users/joons/Downloads/wages.csv")

In [3]:
df

              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
3     80478.096153   63.22  female  other  16   95
4     82089.345498   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1379 rows x 6 columns]

groupby == for 문

In [11]:
for sex in list(df.sex.unique()):
    print(df[df.sex == sex ]['age'].mean())

43.90769230769231
46.18859138533178

In [8]:
for i in df.groupby('sex'):
    print(type(i))

<class 'tuple'>
<class 'tuple'>

In [ ]:
a,b = (1,2)

In [12]:
df.groupby('sex')['age'].mean()

sex
female    46.188591
male      43.907692
Name: age, dtype: float64

In [30]:
df['age'] / df['age'].sum()

0       0.000784
1       0.000992
2       0.000528
3       0.001520
4       0.000688
          ...
1374    0.000528
1375    0.001376
1376    0.000592
1377    0.000864
1378    0.000496
Name: age, Length: 1379, dtype: float64

In [10]:
for attrs, values in df.groupby('sex'):
    print(values)

               earn  height     sex      race  ed  age
1      96396.988643   66.23  female     white  16   62
2      48710.666947   63.77  female     white  16   33
3      80478.096153   63.22  female     other  16   95
4      82089.345498   63.08  female     white  17   43
5      15313.352901   64.53  female     white  15   30
...             ...     ...     ...       ...  ..  ...
1368    4184.222685   60.19  female  hispanic   6   71
1370  175901.453598   65.90  female     other  18   52
1373   16905.557851   70.08  female     white  16   40
1375   24853.519514   61.31  female     white  18   86
1376   13710.671312   63.64  female     white  12   37

[859 rows x 6 columns]
              earn  height   sex      race  ed  age
0     79571.299011   73.89  male     white  16   49
7     50960.054282   73.29  male     white  17   50
8      3212.649556   72.24  male  hispanic  15   25
9     42996.637884   72.40  male     white  12   30
10    10328.618843   70.22  male     white  16   69
...            ...     ...   ...       ...  ..  ...
1371  87473.968778   68.82  male     white  18   75
1372  92205.596106   69.62  male     white  18   57
1374  30173.380363   71.68  male     white  12   33
1377  95426.014410   71.65  male     white  12   54
1378   9575.461857   68.22  male     white  12   31

[520 rows x 6 columns]

groupby 연산자

- transform ?? --> 변형 --> 개별 row 변환

In [25]:
v = np.array([1,2,3])
v/v.sum()

array([0.16666667, 0.33333333, 0.5       ])

In [38]:
def t (v):
    return v/v.mean()
    
# 정규화... 

df.groupby('sex')[['age','earn']].transform( t )

           age      earn
0     1.115978  1.730069
1     1.342323  3.975847
2     0.714462  2.009048
3     2.056785  3.319280
4     0.930966  3.385735
...        ...       ...
1374  0.751577  0.656041
1375  1.861932  1.025071
1376  0.801064  0.565490
1377  1.229853  2.074789
1378  0.706027  0.208193

[1379 rows x 2 columns]

filter...

In [43]:
df.age > 30

0       True
1       True
2       True
3       True
4       True
        ...
1374    True
1375    True
1376    True
1377    True
1378    True
Name: age, Length: 1379, dtype: bool

In [53]:
df.race.value_counts()

white       1147
black        126
hispanic      77
other         29
Name: race, dtype: int64

In [79]:
a = df.groupby('race').earn.mean()
df.loc[df.race.isin(list(a[a>30000].index))]

              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
3     80478.096153   63.22  female  other  16   95
4     82089.345498   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1176 rows x 6 columns]

In [91]:
for i in range(5):
    df = pd.concat([df,df])

In [92]:
df.shape

(45187072, 6)

In [93]:
def f__(df):
    if df['earn'].mean() > 30000:
        return True
    return False

import time
s = time.time()
df.groupby('race').filter(f__)
print( time.time() - s )

24.192825078964233

In [94]:
s = time.time()
a = df.groupby('race').earn.mean()
df.loc[df.race.isin(list(a[a>30000].index))]
print( time.time() - s )

7.992776155471802